import random

te = ["グー","チョキ","パー"]

#勝ち/負け/あいこのカウント
wins = 0    #人間のスコア
loses = 0   #コンピュータのスコア
ties = 0

#ゲーム開始
for turn in range(1,11): #ゲームのループは10回
    print(f"第{turn}回：")
    print(f"現在{wins}勝 {loses}敗 あいこ{ties}回です")

    while True: #入力のループ
        try:
            player_move = int(input("グー：0、チョキ：1、パー：2、ゲーム終了：3 ->"))
            if player_move == 3:
                wins -= 1
                break  #ゲーム終了なので入力のループから抜ける
            if player_move >= 0 and player_move <= 2:
                break   #勝ち負けの判定に行く
        except ValueError:
            print("0から3までの数字を入力してくださいね")
    #入力のループここまで

    if player_move == 3:
        break #ゲームのループからも抜ける

    #コンピュータは人間の手をあえて見ないようにして出す手を後出ししている
    computer_move = random.randint(0, 2)
    print(f"コンピュータ：{te[computer_move]}　あなた：{te[player_move]} ", end="")

    #勝敗の判定　　　(参考リンク： https://qiita.com/mpyw/items/3ffaac0f1b4a7713c869 )
    judge=(player_move - computer_move + 3) % 3
    if judge == 0:  #あいこ
        print("…あいこでした")
        ties += 1
    elif judge == 1:    #負け
        print("…あなたの負けです💦")
        loses += 1
    else:    #勝ち
        print("…あなたの勝ちです！")
        wins += 1

    """"    前のバージョンの勝敗判定
    if computer_move == player_move:    #まずはあいこ
        print("あいこです")
        ties += 1
    else:   #勝ちか負けのパターン
        if computer_move == 0:    #コンピュータがグーの場合
            print("コンピュータ：グー　", end="")
            if player_move == 1:  #人間はチョキ
                print("あなた：チョキ …あなたの負けです")
                loses += 1
            else:  #人間はパー
                print("あなた：パー …あなたの勝ちです")
                wins += 1
        elif computer_move == 1:    #コンピュータがチョキの場合
            print("コンピュータ：チョキ　", end="")
            if player_move == 0:  #人間はグー
                print("あなた：グー …あなたの勝ちです")
                wins += 1
            else:   #人間はパー
                print("あなた：パー …あなたの負けです")
                loses += 1
        else:   #コンピュータがパーの場合
            print("コンピュータ：パー　", end="")
            if player_move == 0:  #人間はグー
                print("あなた：グー …あなたの負けです")
                loses += 1
            else:   #人間はチョキ
                print("あなた：チョキ …あなたの勝ちです")
                wins += 1
    """
    #ゲームのループここまで

#結果発表
print("*** 結果発表 ***")
print(f"あなた：{wins}点 コンピュータ：{loses}点")
if wins > loses:
    print("🎊おめでとう！あなたの勝ちです！🎉")
elif wins < loses:
    print("(ﾉД`)残念！あなたの負けです！💀")
else:
    print("同点引き分けです。もう一度プレイしましょう！")